# Lesson 3 – Introduction to Pandas
In this lesson, we'll practice:
- Importing the Pandas library
- Creating and exploring DataFrames
- Reading data from CSV files
- Performing simple data analysis

In [1]:
import pandas as pd

In [2]:
# Create a DataFrame from a dictionary
data = {
    "Name": ["Alice", "Bob", "Charlie", "Diana"],
    "Age": [25, 30, 35, 40],
    "City": ["New York", "Los Angeles", "Chicago", "Houston"]
}

df = pd.DataFrame(data)
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    Diana   40      Houston

In [3]:
# Load a dataset from the web
url = "https://people.sc.fsu.edu/~jburkardt/data/csv/airtravel.csv"
airtravel = pd.read_csv(url)

# Show first 5 rows
airtravel.head()

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472

In [4]:
print("Shape of dataset:", airtravel.shape)   # rows and columns
print("Column names:", airtravel.columns)     # column names
print("Summary statistics:")
print(airtravel.describe())                   # summary stats

Shape of dataset: (12, 4)
Column names: Index(['Month', ' "1958"', ' "1959"', ' "1960"'], dtype='object')
Summary statistics:
           "1958"      "1959"      "1960"
count   12.000000   12.000000   12.000000
mean   381.000000  428.333333  476.166667
std     64.530472   69.830097   77.737125
min    310.000000  342.000000  390.000000
25%    339.250000  387.500000  418.500000
50%    360.500000  406.500000  461.000000
75%    411.750000  465.250000  514.750000
max    505.000000  559.000000  622.000000

✍️ **Your Turn:**
1. Create your own DataFrame with at least 3 columns and 5 rows.
2. Use `df.head(10)` to preview the first 10 rows of the airtravel dataset.
3. Use `df.describe()` to get summary statistics on your own dataset.